package task.collection;

public class Collection {
    public static void main(String[] args) {


    }

    // Реализуйте функциональность согласно описанию

    // TODO: Для каждой задачи сгенерируйте самостоятельно коллекции и карты для тестирования своих методов

    // TODO: Найти наибольший элемент в списке.

    // TODO: Удалить все дубликаты из списка.

    // TODO: Отсортировать список в порядке убывания.

    // TODO: Проверить, содержит ли множество определенный элемент.

    // TODO: Найти пересечение двух множеств.

    // TODO: Удалить все элементы из множества, которые также содержатся в другом множестве.

    // TODO: Проверить, содержит ли карта определенный ключ.

    // TODO: Получить все значения, связанные с определенным ключом.

    // TODO: Удалить все записи из карты, у которых значение равно определенному значению.

    // TODO: Добавить элемент в очередь.

    // TODO: Получить и удалить первый элемент из очереди.

    // TODO: Проверить, пуста ли очередь.

    // TODO: Учет заказов:
    //  Создайте класс Order с полями id, customer и totalAmount.
    //  Создайте метод, который будет принимать список заказов и выводить заказы с наибольшей суммой.
    //  Создайте метод, который будет принимать список заказов и возвращать общую сумму всех заказов.

    // TODO: Управление задачами:
    //  Создайте класс Task с полями id, title и completed.
    //  Создайте метод, который будет принимать список задач и выводить только незавершенные задачи на экран.
    //  Создайте метод, который будет принимать список задач и возвращать список задач с определенным заголовком.

    // TODO: Создание списка студентов:
    //  Создайте класс Student с полями name и age.
    //  Создайте метод, который будет принимать список студентов и выводить их на экран.
    //  Создайте метод, который будет принимать список студентов и возвращать список студентов, у которых возраст больше определенного значения.

    // TODO: Учет товаров на складе:
    //  Создайте класс Product с полями id, name и quantity.
    //  Создайте метод, который будет принимать список товаров и выводить только товары с нулевым количеством на складе.
    //  Создайте метод, который будет принимать список товаров и возвращать общее количество товаров на складе.

    // TODO: Учет посещаемости:
    //  Создайте класс Student с полями name и attendance.
    //  Создайте метод, который будет принимать список студентов и выводить студентов с наихудшей посещаемостью.
    //  Создайте метод, который будет принимать список студентов и возвращать среднюю посещаемость.
}